In [6]:
import pandas as pd

In [46]:
names=['kim','lee','choi','park','jung']
kors=[80,75,60,70,95]
engs=[85,70,65,75,90]
maths=[80,75,70,65,85]
data={'name':names, 'kor':kors, 'eng':engs, 'math':maths}
df1=pd.DataFrame(data, index=['a','b','c','d','e'])
df1

   name  kor  eng  math
a   kim   80   85    80
b   lee   75   70    75
c  choi   60   65    70
d  park   70   75    65
e  jung   95   90    85

In [47]:
df1.sum(axis=0)

name    kimleechoiparkjung
kor                    380
eng                    385
math                   375
dtype: object

In [48]:
df1.max(axis=0)

name    park
kor       95
eng       90
math      85
dtype: object

In [49]:
df1['class']=['A','B','B','A','A']
df1['total']=df1.kor + df1.eng + df1.math
df1

   name  kor  eng  math class  total
a   kim   80   85    80     A    245
b   lee   75   70    75     B    220
c  choi   60   65    70     B    195
d  park   70   75    65     A    210
e  jung   95   90    85     A    270

In [51]:
print(df1.groupby('class').mean())
print(df1.groupby('class')['total'].mean())

             kor        eng       math       total
class
A      81.666667  83.333333  76.666667  241.666667
B      67.500000  67.500000  72.500000  207.500000
class
A    241.666667
B    207.500000
Name: total, dtype: float64

C:\Users\admin\AppData\Local\Temp\ipykernel_17720\3100589687.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(df1.groupby('class').mean())
C:\Users\admin\AppData\Local\Temp\ipykernel_17720\3100589687.py:7: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.corr()

            kor       eng      math     total
kor    1.000000  0.912903  0.855186  0.981866
eng    0.912903  1.000000  0.762493  0.949652
math   0.855186  0.762493  1.000000  0.904819
total  0.981866  0.949652  0.904819  1.000000

In [24]:
input_file='data/input.csv'
output_file='data/output1.csv'

In [26]:
df=pd.read_csv(input_file)
df

   Supplier Name Invoice Number  Part Number      Cost Purchase Date
0              A       001-1001         2341  $500,000    2014-01-20
1              A       001-1001         5467    500000    2014-01-20
2              A       001-1001         5407    750000    2014-01-20
3              A       001-1001         2341    750000    2014-01-20
4              B        50-9501         7009    250000    2018-01-30
5              B        50-9501         7009    250000    2018-01-30
6              B        50-9505         6650    125000    2017-02-03
7              B        50-9505         6650    125000    2017-02-03
8              C       920-4803         3321    615000    2017-02-03
9              C       920-4804         3321    615000    2017-02-10
10             C       920-4805         3321    615000    2017-02-17
11             C       920-4806         3321    615000    2017-02-24

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Supplier Name   12 non-null     object
 1   Invoice Number  12 non-null     object
 2   Part Number     12 non-null     int64
 3   Cost            12 non-null     object
 4   Purchase Date   12 non-null     object
dtypes: int64(1), object(4)
memory usage: 608.0+ bytes

In [31]:
#1. SupplierName으로 GroupBy()
#2. Cost 평균값 구하기
#주의1. Cost 첫번째 데이터 $, 쉼표 제거
#주의2. Cost 데이터 타입 Object -> float형태로 변환

df['Cost']=df['Cost'].str.strip('$').str.replace(',','').astype(float)
df

   Supplier Name Invoice Number  Part Number      Cost Purchase Date
0              A       001-1001         2341  500000.0    2014-01-20
1              A       001-1001         5467  500000.0    2014-01-20
2              A       001-1001         5407  750000.0    2014-01-20
3              A       001-1001         2341  750000.0    2014-01-20
4              B        50-9501         7009  250000.0    2018-01-30
5              B        50-9501         7009  250000.0    2018-01-30
6              B        50-9505         6650  125000.0    2017-02-03
7              B        50-9505         6650  125000.0    2017-02-03
8              C       920-4803         3321  615000.0    2017-02-03
9              C       920-4804         3321  615000.0    2017-02-10
10             C       920-4805         3321  615000.0    2017-02-17
11             C       920-4806         3321  615000.0    2017-02-24

In [32]:
result1=df.loc[(df['Cost']>=600000) & (df['Supplier Name']=='A')]
result1

  Supplier Name Invoice Number  Part Number      Cost Purchase Date
2             A       001-1001         5407  750000.0    2014-01-20
3             A       001-1001         2341  750000.0    2014-01-20

In [34]:
result2=df.loc[(df['Cost']>=500000) & (df['Cost']<=700000)]
result2

   Supplier Name Invoice Number  Part Number      Cost Purchase Date
0              A       001-1001         2341  500000.0    2014-01-20
1              A       001-1001         5467  500000.0    2014-01-20
8              C       920-4803         3321  615000.0    2017-02-03
9              C       920-4804         3321  615000.0    2017-02-10
10             C       920-4805         3321  615000.0    2017-02-17
11             C       920-4806         3321  615000.0    2017-02-24

In [36]:
result3=df.groupby('Supplier Name')['Cost'].mean()
result3

Supplier Name
A    625000.0
B    187500.0
C    615000.0
Name: Cost, dtype: float64

In [53]:
result2.to_csv(output_file,index=False)

In [54]:
df1['total'].corr(df1['kor'])

0.981865935985552

In [56]:
df1['total'].corr(df1['eng'])

0.949651549647939

In [57]:
df1['total'].corr(df1['math'])

0.9048187022009941

In [58]:
df1.corr()

C:\Users\admin\AppData\Local\Temp\ipykernel_17720\473017434.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.corr()

            kor       eng      math     total
kor    1.000000  0.912903  0.855186  0.981866
eng    0.912903  1.000000  0.762493  0.949652
math   0.855186  0.762493  1.000000  0.904819
total  0.981866  0.949652  0.904819  1.000000